def add_race_14_07_2019_oli
  race = Race.create title: "Спринт-триатлон на острове Русском (олимпийская дистанция)", date: "14.07.2019"

  RaceDiscipline.create race_id: race.id, discipline_id: SWIM.id, position: 1, distance: 1.5.to_f32
  RaceDiscipline.create race_id: race.id, discipline_id: BICYCLE.id, position: 3, distance: 40.0.to_f32
  RaceDiscipline.create race_id: race.id, discipline_id: RUN.id, position: 5, distance: 10.0.to_f32

  add_result(race, "Женщины", "", "Владивосток", "Грибановка", "1:12:40", "0:16:50", "0:33:19", "0:20:55")
  add_result(race, "Женщины", "", "Владивосток", "Грибановка", "1:12:40", "0:16:50", "0:33:19", "0:20:55")

  add_result(race, "Мужчины", "", "Владивосток", "Грибановка", "1:12:40", "0:16:50", "0:33:19", "0:20:55")
  add_result(race, "Мужчины", "", "Владивосток", "Грибановка", "1:12:40", "0:16:50", "0:33:19", "0:20:55")
  add_result(race, "Мужчины", "", "Владивосток", "Грибановка", "1:12:40", "0:16:50", "0:33:19", "0:20:55")
  add_result(race, "Мужчины", "", "Владивосток", "Грибановка", "1:12:40", "0:16:50", "0:33:19", "0:20:55")
  add_result(race, "Мужчины", "", "Владивосток", "Грибановка", "1:12:40", "0:16:50", "0:33:19", "0:20:55")

  add_result(race, "Мужчины", "", "Владивосток", "Грибановка", "1:12:40", "0:16:50", "0:33:19", "0:20:55")
  add_result(race, "Мужчины", "", "Владивосток", "Грибановка", "1:12:40", "0:16:50", "0:33:19", "0:20:55")
  add_result(race, "Мужчины", "", "Владивосток", "Грибановка", "1:12:40", "0:16:50", "0:33:19", "0:20:55")
  add_result(race, "Мужчины", "", "Владивосток", "Грибановка", "1:12:40", "0:16:50", "0:33:19", "0:20:55")
  add_result(race, "Мужчины", "", "Владивосток", "Грибановка", "1:12:40", "0:16:50", "0:33:19", "0:20:55")
end
