def add_race_14_07_2019_sprint
  race = Race.create title: "Спринт-триатлон на острове Русском (спринт)", date: "14.07.2019"

  RaceDiscipline.create race_id: race.id, discipline_id: SWIM.id, position: 1, distance: 0.75.to_f32
  RaceDiscipline.create race_id: race.id, discipline_id: BICYCLE.id, position: 3, distance: 20.0.to_f32
  RaceDiscipline.create race_id: race.id, discipline_id: RUN.id, position: 5, distance: 5.0.to_f32

  add_result(race, "Женщины", "Грибанова Ирина", "Владивосток", "Лично", "1:46:11", "0:23:38", "0:44:46", "0:37:47")
  add_result(race, "Женщины", "Белоногова Анна", "Владивосток", "Не будь как Гриша", "2:26:25", "0:28:24", "1:17:09", "0:40:52")
  add_result(race, "Женщины", "Шпунева Виктория", "Владивосток", "LOVE", nil, "0:18:13", nil, nil)

  add_result(race, "Мужчины", "Ураков Валерий", "Владивосток", "Морпех", "1:44:45", "0:20:08", "0:33:19", "0:20:55")
  add_result(race, "Мужчины", "Зуев Руслан", "Владивосток", "Лично", "1:48:31", "0:17:24", "0:33:19", "0:20:55")
  add_result(race, "Мужчины", "Минаев Василий", "Владивосток", "Лично", "1:52:05", "0:20:14", "0:33:19", "0:20:55")
  add_result(race, "Мужчины", "Гатауллин Андрей", "Спасск", "Лично", "1:59:20", "0:24:58", "0:33:19", "0:20:55")
  add_result(race, "Мужчины", "Сяткин Юрий", "Владивосток", "Лично", "2:00:52", "0:24:49", "0:33:19", "0:20:55")

  add_result(race, "Мужчины", "Денейкин Сергей", "Партизанск", "Лично", "2:02:59", "0:25:45", "0:33:19", "0:20:55")
  add_result(race, "Мужчины", "Полушин Максим", "Владивосток", "Лично", "2:03:15", "0:15:44", "0:33:19", "0:20:55")
  add_result(race, "Мужчины", "Мазняк Антон", "Арсеньев", "лисапедия", "2:03:34", "0:27:00", "0:33:19", "0:20:55")
  add_result(race, "Мужчины", "Лизию Роман", "Владивосток", "RunDNSRun", "2:06:27", "0:25:24", "0:33:19", "0:20:55")
  add_result(race, "Мужчины", "Лагоша Александр", "Владивосток", "Гонка Героев", "2:06:30", "0:25:42", "0:33:19", "0:20:55")

  add_result(race, "Мужчины", "Калина Павел", "Артем", "Лично", "2:06:54", "0:23:09", "0:33:19", "0:20:55")
  add_result(race, "Мужчины", "Липин Максим", "Владивосток", "Лично", "2:12:52", "0:24:15", "0:33:19", "0:20:55")
  add_result(race, "Мужчины", "Иванюк Денис", "Находка", "Карпы", "2:17:58", "0:16:50", "0:33:19", "0:20:55")
  add_result(race, "Мужчины", "Епишко Алексей", "Партизанск", "Лично", "2:20:09", "0:16:50", "0:33:19", "0:20:55")
  add_result(race, "Мужчины", "Мазур Максим", "Владивосток", "Лично", "2:26:37", "0:16:50", "0:33:19", "0:20:55")

  add_result(race, "Мужчины", "Варенко Михаил", "Владивосток", "Лично", "2:28:49", "0:16:50", "0:33:19", "0:20:55")
  add_result(race, "Мужчины", "Чернышев Евгений", "Партизанск", "Лично", "2:31:08", "0:16:50", "0:33:19", "0:20:55")
  add_result(race, "Мужчины", "Гончаров Владимир", "Артем", "Лично", "2:32:23", "0:16:50", "0:33:19", "0:20:55")
  add_result(race, "Мужчины", "Ташкинов Станислав", "Владивосток", "Контрабанда", nil, "0:27:50", "0:33:19", nil)
  add_result(race, "Мужчины", "Щекалев Денис", "Владивосток", "Лично", nil, "0:16:50", "0:33:19", nil)
end
